trade_exp/src/InformationRegisters/СтоимостьТоваров/СтоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="87cff055-8d3c-4020-b203-32328c4a2840">
  <name>СтоимостьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="71f63ec4-ea0b-4ae3-90d4-b6205a907ce2">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0b241135-b3a1-48c8-ad6d-c204ac7aa0ff">
    <name>СтоимостьБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6783ed02-930e-44fd-91ba-b9d203ca22dd">
    <name>СтоимостьРегл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bc1038b5-0d48-4887-a43e-c756a1be0079">
    <name>СтоимостьУпр</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8f2a7c4c-5c5e-4823-b418-9d03c7b774cf">
    <name>СтоимостьДопРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6613e924-7993-4c1e-a3a6-a4abbee5c527">
    <name>ДопРасходыУпр</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7ca4d096-e995-4b41-b0aa-a35cb6c72df2">
    <name>ДопРасходыРегл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4d86277d-0138-489d-91f3-6faddd0e2483">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6f4d7821-72ce-4777-bfad-99654afdd291">
    <name>ТрудозатратыУпр</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="17f1d2f4-63ae-4c08-a409-f1009114064e">
    <name>ТрудозатратыРегл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="1be4a6a0-57f5-4a24-866e-1cf15709bffd">
    <name>ПостатейныеПостоянныеСНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d9154c83-b15c-4c06-9d1d-71f0eb961dbd">
    <name>ПостатейныеПеременныеСНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7e8319c7-77b9-43fc-b0ee-72dde2e12493">
    <name>ПостатейныеПостоянныеБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e0468298-bbe9-4aa1-8a6c-6938e17b5a2a">
    <name>ПостатейныеПеременныеБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b454aad0-164e-4988-a91a-2063027e5e33">
    <name>ПостатейныеПостоянныеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9d3d4204-fa39-4eeb-8e4c-386aa8858382">
    <name>ПостатейныеПеременныеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="780c0e92-ec68-4966-a99b-c071be113e5f">
    <name>ПостатейныеПостоянныеУпр</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="493fa2fb-0b5b-4344-b129-30afec25f124">
    <name>ПостатейныеПеременныеУпр</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7c963e29-6357-4374-970c-828d2ec6083b">
    <name>СтоимостьДопРасходыБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>31</precision>
          <scale>10</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d896922b-cbc7-488a-acf4-72320ba6bd73">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="56a809db-4080-4724-a60e-10acc957e194">
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b2272977-5642-42d4-a8bc-1033cd82bc67">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="83613876-56c0-40ba-ae8e-5f944bb865dc">
    <name>РазделУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СебестоимостьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <attributes extendedConfigurationObject="3d7f4871-4ad5-47c1-ae72-77ffba33a92e">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="935bd59c-89ae-4e2b-990a-97233617ce3d">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f8e7972-07b8-4c04-97a1-a6fcfdcd4b2c">
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ffeff26a-c1d5-4cb3-a410-81eb32db8022">
    <name>СтатьяРасходовСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e51bd0ad-2d52-4827-b5bb-83d36a080227">
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbe323e6-5da5-4078-bbcc-48cf76333c4b">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f6a0080e-a2e3-4ed1-a4d2-42d9b01b3fbe">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="54deafa3-3c0c-49db-874d-0ed14fdd4781">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3940101b-5682-4dc0-af5e-686005c0a991">
    <name>АналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/ИсточникиИнформацииОЦенахДляПечати/ИсточникиИнформацииОЦенахДляПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ИсточникиИнформацииОЦенахДляПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоСебестоимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоВидуЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ПорчаТоваров/ПорчаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорчаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПриходоватьТоварыПоСебестоимостиСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентУценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2b90162-0de9-4ba3-8191-3343ac456458">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1de82408-fd44-4902-a127-615efb15ec61">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПодНазначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a93462a1-6dbb-448f-838d-9341e6b16bc0">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b61f9554-9e2a-4b02-9b30-30effaa6a205">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="12f17b4e-49b6-4c83-8443-9424e7ac6b1a">
      <name>АналитикаУчетаНоменклатурыОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/ПорчаТоваровЛокализация/Module.bsl
&После("ДобавитьКомандыПечати")
Процедура Док_ДобавитьКомандыПечати(КомандыПечати)
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.ПорчаТоваров) И ПравоДоступа("Просмотр", Метаданные.Документы.ПорчаТоваров) Тогда
		// Акт о порче, бое, ломе ТМЦ (ТОРГ-15)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ТОРГ15";
		КомандаПечати.Представление = НСтр("ru = 'Акт о порче, бое, ломе ТМЦ (ТОРГ-15)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьКачествоТоваров";
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуТОРГ15Экспорт(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) экспорт
	Возврат СформироватьПечатнуюФормуТОРГ15(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
КонецФункции


&ИзменениеИКонтроль("СформироватьПечатнуюФормуТОРГ15")
Функция Док_СформироватьПечатнуюФормуТОРГ15(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	УстановитьПривилегированныйРежим(Истина);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	

	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	РасчетСебестоимостиТоваровОрганизации.Ссылка.ПредварительныйРасчет КАК ПредварительныйРасчет,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Организация.КодПоОКПО) КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Организация.Префикс) КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Склад) КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Подразделение) КАК ПодразделениеПредставление,
	|	Документ.ПриходоватьТоварыПоСебестоимостиСписания КАК ПриходоватьТоварыПоСебестоимостиСписания,
	|	Документ.ПричинаПорчи КАК НаименованиеПричины,
	|	Документ.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(Документ.ИсправляемыйДокумент.Номер, Документ.Номер) КАК Номер,
	|	ЕСТЬNULL(Документ.ИсправляемыйДокумент.Дата, Документ.Дата) КАК ДатаДокумента,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Валюта КАК ВалютаДокумента,
	|	Документ.Склад.ТекущийОтветственный КАК Кладовщик,
	|	Документ.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	Документ.Ответственный.ФизическоеЛицо КАК Ответственный,
	|	Документ.ВидЦены КАК ВидЦен,
	|	Документ.ВидЦены.ВалютаЦены КАК ВалютаВидаЦены,
	|	Документ.Склад КАК Склад,
	|	Документ.Ответственный.ФизическоеЛицо КАК Расчетчик,
	|	Документ.ИсточникИнформацииОЦенахДляПечати КАК ИсточникИнформацииОЦенахДляПечати
	|ИЗ
	|	Документ.ПорчаТоваров КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиТоваровОрганизации
	|		ПО Документ.Организация = РасчетСебестоимостиТоваровОрганизации.Организация
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Документ.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(Документ.Дата, МЕСЯЦ))
	|			И (РасчетСебестоимостиТоваровОрганизации.Ссылка.Проведен)
	|			И РасчетСебестоимостиТоваровОрганизации.Ссылка.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документ.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	ВыборкаПоДокументам		= ЗапросПоДокументам.Выполнить().Выбрать();

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПорчаТоваров.ПФ_MXL_ТОРГ15_ru");
	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;

	ТабДокумент = Новый ТабличныйДокумент;
	// Зададим параметры макета по-умолчанию
	ТабДокумент.ПолеСверху = 10;
	ТабДокумент.ПолеСлева = 10;
	ТабДокумент.ПолеСнизу = 10;
	ТабДокумент.ПолеСправа = 10;
	#Удаление
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	#КонецУдаления
	#Вставка
	Если ПараметрыПечати.Свойство("ПечатьКомплектаДокументовПересчет") Тогда
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	#КонецВставки

	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПорчаТоваров_ТОРГ15";

	ОбластьШапки 						= Макет.ПолучитьОбласть("Шапка");     
	ОбластьЗаголовокТаблицы				= Макет.ПолучитьОбласть("ЗаголовокТаблицыТоварыУценка");
	ОбластьСтрока 						= Макет.ПолучитьОбласть("СтрокаТоварыУценка");
	ОбластьИтого 						= Макет.ПолучитьОбласть("ИтогоТоварыУценка");
	ОбластьПодвал 						= Макет.ПолучитьОбласть("ПодвалТоварыУценка");
	ОбластьЗаголовокТаблицыУтиль		= Макет.ПолучитьОбласть("ЗаголовокТаблицыУтиль");
	ОбластьСтрокаУтиль					= Макет.ПолучитьОбласть("СтрокаУтиль");
	ОбластьИтогоУтиль 					= Макет.ПолучитьОбласть("ИтогоУтиль");
	ОбластьПодписи						= Макет.ПолучитьОбласть("ПодвалПодписи");
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;

	НомерДокумента = 0;
	КоличествоДокументов = ВыборкаПоДокументам.Количество();
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;

	Пока ВыборкаПоДокументам.Следующий() Цикл

		ЗапросПоТоварам = Новый Запрос;

		Если ВыборкаПоДокументам.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда

			ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ВыборкаПоДокументам.Дата);

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ПорчаТоваровТовары.Ссылка КАК Ссылка,
			|	ПорчаТоваровТовары.НомерСтроки КАК НомерСтроки,
			|	ПорчаТоваровТовары.Номенклатура КАК Номенклатура,
			|	ПорчаТоваровТовары.Характеристика КАК Характеристика,
			|	ПорчаТоваровТовары.Серия КАК Серия,
			|	ПорчаТоваровТовары.НоменклатураОприходование КАК НоменклатураОприходование,
			|	ПорчаТоваровТовары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
			|	ПорчаТоваровТовары.НоменклатураОприходование.Качество КАК ГрадацияКачества,
			|	ПорчаТоваровТовары.Количество КАК Количество,
			|	ПорчаТоваровТовары.Цена КАК Цена,
			|	&ПоляДляЦенообразованияВыборка,
			|	ПорчаТоваровТовары.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания КАК ПриходоватьТоварыПоСебестоимостиСписания
			|ПОМЕСТИТЬ ПорчаТоваровТовары
			|ИЗ
			|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|		ПО ВидыНоменклатуры.Ссылка = ПорчаТоваровТовары.Номенклатура.ВидНоменклатуры
			|ГДЕ
			|	ПорчаТоваровТовары.Ссылка = &ТекущийДокумент
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПорчаТоваровТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
			|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровТовары.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
			|	ПорчаТоваровТовары.НомерСтроки КАК НомерСтроки,
			|	ПорчаТоваровТовары.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА ПорчаТоваровТовары.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
			|			ТОГДА 0
			|		ИНАЧЕ ПорчаТоваровТовары.Количество
			|	КОНЕЦ КАК УценкаКоличество,
			|	ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА ПорчаТоваровТовары.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
			|			ТОГДА 0
			|		КОГДА ПорчаТоваровТовары.ПриходоватьТоварыПоСебестоимостиСписания
			|			ТОГДА ВЫБОР
			|					КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки1 ЕСТЬ NULL 
			|							И &ТекстЗапросаКоэффициентУпаковки1 <> 0
			|						ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки1
			|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
			|				КОНЕЦ * &КоэффициентПересчетаВалютыВидаЦенВВалютуРегл
			|		ИНАЧЕ ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл
			|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК УценкаЦена,
			|	ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА ПорчаТоваровТовары.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
			|			ТОГДА 0
			|		КОГДА ПорчаТоваровТовары.ПриходоватьТоварыПоСебестоимостиСписания
			|			ТОГДА ВЫБОР
			|					КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки1 ЕСТЬ NULL 
			|							И &ТекстЗапросаКоэффициентУпаковки1 <> 0
			|						ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки1
			|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
			|				КОНЕЦ * &КоэффициентПересчетаВалютыВидаЦенВВалютуРегл
			|		ИНАЧЕ ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл
			|	КОНЕЦ КАК ЧИСЛО(31,2)) * ПорчаТоваровТовары.Количество КАК УценкаСтоимость,
			|	ПорчаТоваровТовары.Номенклатура.Код КАК ТоварКод,
			|	ПорчаТоваровТовары.Номенклатура.Артикул КАК ТоварАртикул,
			|	ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки1 ЕСТЬ NULL 
			|				И &ТекстЗапросаКоэффициентУпаковки1 <> 0
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки1
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
			|	КОНЕЦ * &КоэффициентПересчетаВалютыВидаЦенВВалютуРегл КАК ЧИСЛО(31,2)) КАК Цена,
			|	ПорчаТоваровТовары.ГрадацияКачества КАК ГрадацияКачества,
			|	ПорчаТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
			|	ПорчаТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ
			|ИЗ
			|	ПорчаТоваровТовары КАК ПорчаТоваровТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ &ЦеныНоменклатурыСрезПоследних1 КАК ЦеныНоменклатуры
			|		ПО 
			|			&УсловиеСоедиенияЦеныНоменклатурыСрезПоследних1
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорчаТоваровТовары.Ссылка,
			|	ПорчаТоваровТовары.НомерСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПорчаТоваровТовары.НоменклатураОприходование.НаименованиеПолное КАК УтильНоменклатура,
			|	ПорчаТоваровТовары.ХарактеристикаОприходование.НаименованиеПолное КАК УтильХарактеристика,
			|	&ТекстЗапросаКолонкаКодов КАК УтильКод,
			|	СУММА(ПорчаТоваровТовары.Количество) КАК Количество,
			|	ПорчаТоваровТовары.ГрадацияКачества КАК ГрадацияКачества,
			|	ПорчаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
			|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
			|	ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА ПорчаТоваровТовары.ПриходоватьТоварыПоСебестоимостиСписания
			|			ТОГДА ВЫБОР
			|					КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки2 ЕСТЬ NULL 
			|							И &ТекстЗапросаКоэффициентУпаковки2 <> 0
			|						ТОГДА ЕСТЬNULL(ЦеныУтиль.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки2
			|					ИНАЧЕ ЕСТЬNULL(ЦеныУтиль.Цена, 0)
			|				КОНЕЦ * &КоэффициентПересчетаВалютыВидаЦенВВалютуРегл
			|		ИНАЧЕ ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл
			|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена
			|ИЗ
			|	ПорчаТоваровТовары КАК ПорчаТоваровТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ &ЦеныНоменклатурыСрезПоследних КАК ЦеныУтиль
			|		ПО 
			|			&УсловиеСоедиенияЦеныНоменклатурыСрезПоследних
			|ГДЕ
			|	ПорчаТоваровТовары.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПорчаТоваровТовары.НоменклатураОприходование.НаименованиеПолное,
			|	ПорчаТоваровТовары.ХарактеристикаОприходование.НаименованиеПолное,
			|	&ТекстЗапросаКолонкаКодов,
			|	ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА ПорчаТоваровТовары.ПриходоватьТоварыПоСебестоимостиСписания
			|			ТОГДА ВЫБОР
			|					КОГДА НЕ &ТекстЗапросаКоэффициентУпаковки2 ЕСТЬ NULL 
			|							И &ТекстЗапросаКоэффициентУпаковки2 <> 0
			|						ТОГДА ЕСТЬNULL(ЦеныУтиль.Цена, 0) / &ТекстЗапросаКоэффициентУпаковки2
			|					ИНАЧЕ ЕСТЬNULL(ЦеныУтиль.Цена, 0)
			|				КОНЕЦ * &КоэффициентПересчетаВалютыВидаЦенВВалютуРегл
			|		ИНАЧЕ ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл
			|	КОНЕЦ КАК ЧИСЛО(31,2)),
			|	ПорчаТоваровТовары.ГрадацияКачества,
			|	ПорчаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения.Код,
			|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения)";

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатуры.Упаковка",
			"ЦеныНоменклатуры.Номенклатура"));

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныУтиль.Упаковка",
			"ЦеныУтиль.Номенклатура"));

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКолонкаКодов",
			"ПорчаТоваровТовары.НоменклатураОприходование." + КолонкаКодов);

			НастройкаЦенообразования = ЦенообразованиеКлиентСервер.НастройкиДляВременнойТаблицыСДополнениемДляЦенообразования();
			НастройкаЦенообразования.ИсточникТоваров = "ПорчаТоваровТовары";
			НастройкаЦенообразования.ПолеУпаковка = "";

			ТекстЗамены = ЦенообразованиеКлиентСервер.ТекстПолейДляЦенообразования(НастройкаЦенообразования,
			,
			ИспользуетсяЦенообразование25);
			Если ЗначениеЗаполнено(ТекстЗамены) Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразованияВыборка", ТекстЗамены);
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразованияВыборка,", "");
			КонецЕсли;

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ЦеныНоменклатурыСрезПоследних1",
			ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатуры(
			"ПорчаТоваровТовары",
			"&ДатаЦен",
			Новый Структура("ВТаблице", "&ВидЦен"), ИспользуетсяЦенообразование25));

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&УсловиеСоедиенияЦеныНоменклатурыСрезПоследних1",
			ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатурыУсловиеСоединения(
			"ПорчаТоваровТовары",
			"ЦеныНоменклатуры",,ИспользуетсяЦенообразование25));

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ЦеныНоменклатурыСрезПоследних",
			ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатуры(
			"ПорчаТоваровТовары",
			"&ДатаЦен",
			Новый Структура("ВТаблице", "&ВидЦен"), ИспользуетсяЦенообразование25));

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&УсловиеСоедиенияЦеныНоменклатурыСрезПоследних",
			ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатурыУсловиеСоединения(
			"ПорчаТоваровТовары",
			"ЦеныУтиль",,ИспользуетсяЦенообразование25));

			ЗапросПоТоварам.Текст = ТекстЗапроса;
			ЗапросПоТоварам.УстановитьПараметр("ТекущийДокумент", ВыборкаПоДокументам.Ссылка);
			ЗапросПоТоварам.УстановитьПараметр("ДатаЦен", ВыборкаПоДокументам.Дата);
			ЗапросПоТоварам.УстановитьПараметр("ВидЦен", ВыборкаПоДокументам.ВидЦен);

			КоэффицентыВалютыДокумента = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
			ВыборкаПоДокументам.ВалютаДокумента, Неопределено, ВыборкаПоДокументам.Дата, ВыборкаПоДокументам.Организация);
			КоэффицентыВалютыВидаЦен = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
			ВыборкаПоДокументам.ВалютаВидаЦены, Неопределено, ВыборкаПоДокументам.Дата, ВыборкаПоДокументам.Организация);

			ЗапросПоТоварам.УстановитьПараметр("КоэффициентПересчетаВалютыДокументаВВалютуРегл",
			КоэффицентыВалютыДокумента.КоэффициентПересчетаВВалютуРегл);
			ЗапросПоТоварам.УстановитьПараметр("КоэффициентПересчетаВалютыВидаЦенВВалютуРегл",
			КоэффицентыВалютыВидаЦен.КоэффициентПересчетаВВалютуРегл);

			РезультатыПоТоварам = ЗапросПоТоварам.ВыполнитьПакет(); 
			ВыборкаСтрокТовары	= РезультатыПоТоварам[1].Выбрать();
			ВыборкаСтрокУтиль	= РезультатыПоТоварам[2].Выбрать();

		ИначеЕсли ВыборкаПоДокументам.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости Тогда

			Если ВыборкаПоДокументам.ПредварительныйРасчет = Null Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось получить цены по себестоимости для документа %Документ%: на %Период% не произведен расчет себестоимости.'");

				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ВыборкаПоДокументам.Ссылка);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Период%", Формат(НачалоМесяца(ВыборкаПоДокументам.Дата),"ДЛФ=DD"));

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

				Продолжить;
			КонецЕсли;

			ИтераторНомераЗапроса = 0;

			Если ВыборкаПоДокументам.ПредварительныйРасчет Тогда

				ТекстСообщения = НСтр("ru = 'При печати документа %Документ% использовались данные предварительного расчета себестоимости.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ВыборкаПоДокументам.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

				ЗапросПоТоварам.Текст =
				"ВЫБРАТЬ
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
				|	ПорчаТоваровОбщая.ВидЗапасов                  КАК ВидЗапасов,
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
				|	ПорчаТоваровОбщая.Количество                  КАК Количество,
				|	ПорчаТоваровОбщая.НомерСтроки                 КАК НомерСтроки,
				|	ПорчаТоваровОбщая.НоменклатураОприходование   КАК НоменклатураОприходование,
				|	ПорчаТоваровОбщая.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
				|	ПорчаТоваровОбщая.Цена                        КАК Цена,
				|	ПорчаТоваровОбщая.Ссылка                      КАК Ссылка
				|ПОМЕСТИТЬ ПорчаТоваровСКлючамиАналитики
				|ИЗ
				|	(ВЫБРАТЬ
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
				|		ПорчаТоваровВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
				|		ПорчаТоваровВидыЗапасов.Количество КАК Количество,
				|		ПорчаТоваровВидыЗапасов.НомерСтроки КАК НомерСтроки,
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Номенклатура КАК НоменклатураОприходование,
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Характеристика КАК ХарактеристикаОприходование,
				|		ВЫРАЗИТЬ(ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл КАК ЧИСЛО(31,2)) КАК Цена,
				|		ПорчаТоваровВидыЗапасов.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.ПорчаТоваров.ВидыЗапасов КАК ПорчаТоваровВидыЗапасов
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
				|			ПО ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатуры = ПорчаТоваровТовары.АналитикаУчетаНоменклатуры
				|				И ПорчаТоваровВидыЗапасов.Ссылка = ПорчаТоваровТовары.Ссылка
				|	) КАК ПорчаТоваровОбщая
				|
				|ГДЕ
				|	ПорчаТоваровОбщая.Ссылка = &ТекущийДокумент
				|	И ПорчаТоваровОбщая.Ссылка.Организация = &Организация
				|	И ПорчаТоваровОбщая.Ссылка.Проведен
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.НаименованиеПолное КАК УтильНоменклатура,
				|	ПорчаТоваровСКлючамиАналитики.ХарактеристикаОприходование.НаименованиеПолное КАК УтильХарактеристика,
				|	&ТекстЗапросаКолонкаКодов КАК УтильКод,
				|	СУММА(ПорчаТоваровСКлючамиАналитики.Количество) КАК Количество,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество КАК ГрадацияКачества,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ЕСТЬNULL(ЦеныУтиль.СтоимостьРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ДопРасходыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ТрудозатратыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ПостатейныеПостоянныеРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ПостатейныеПеременныеРегл, 0)
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК Цена
				|ИЗ
				|	ПорчаТоваровСКлючамиАналитики КАК ПорчаТоваровСКлючамиАналитики
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&ДатаЦен, ДЕНЬ),
				|				(АналитикаУчетаНоменклатуры, Организация, ВидЗапасов) В
				|					(ВЫБРАТЬ
				|						Таблица.АналитикаУчетаНоменклатуры,
				|						&Организация,
				|						Таблица.ВидЗапасов
				|					ИЗ
				|						ПорчаТоваровСКлючамиАналитики КАК Таблица)) КАК ЦеныУтиль
				|		ПО ПорчаТоваровСКлючамиАналитики.АналитикаУчетаНоменклатуры = ЦеныУтиль.АналитикаУчетаНоменклатуры
				|			И ПорчаТоваровСКлючамиАналитики.ВидЗапасов = ЦеныУтиль.ВидЗапасов
				|			И (ЦеныУтиль.Организация = &Организация)
				|ГДЕ
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|
				|СГРУППИРОВАТЬ ПО
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.НаименованиеПолное,
				|	ПорчаТоваровСКлючамиАналитики.ХарактеристикаОприходование.НаименованиеПолное,
				|	&ТекстЗапросаКолонкаКодов,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ЕСТЬNULL(ЦеныУтиль.СтоимостьРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ДопРасходыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ТрудозатратыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ПостатейныеПостоянныеРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ПостатейныеПеременныеРегл, 0)
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения.Код,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПорчаТоваровСКлючамиАналитики.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
				|	ПорчаТоваровСКлючамиАналитики.НомерСтроки КАК НомерСтроки,
				|	ПорчаТоваровСКлючамиАналитики.Количество КАК Количество,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Количество
				|	КОНЕЦ КАК УценкаКоличество,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.СтоимостьРегл, 0)
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК УценкаЦена,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.СтоимостьРегл, 0) * ПорчаТоваровСКлючамиАналитики.Количество
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена * ПорчаТоваровСКлючамиАналитики.Количество
				|	КОНЕЦ КАК УценкаСтоимость,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.Код КАК ТоварКод,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.Артикул КАК ТоварАртикул,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.СтоимостьРегл, 0)
				|				+ ЕСТЬNULL(ЦеныНоменклатуры.ДопРасходыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныНоменклатуры.ТрудозатратыРегл, 0)
				|				+ ЕСТЬNULL(ЦеныУтиль.ПостатейныеПостоянныеРегл, 0)
				|				+ ЕСТЬNULL(ЦеныНоменклатуры.ПостатейныеПеременныеРегл, 0)
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК Цена,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество КАК ГрадацияКачества,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ
				|ИЗ
				|	ПорчаТоваровСКлючамиАналитики КАК ПорчаТоваровСКлючамиАналитики
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&ДатаЦен, ДЕНЬ),
				|				(АналитикаУчетаНоменклатуры, Организация, ВидЗапасов) В
				|					(ВЫБРАТЬ
				|						Таблица.АналитикаУчетаНоменклатуры,
				|						&Организация,
				|						Таблица.ВидЗапасов
				|					ИЗ
				|						ПорчаТоваровСКлючамиАналитики КАК Таблица)) КАК ЦеныНоменклатуры
				|		ПО ПорчаТоваровСКлючамиАналитики.АналитикаУчетаНоменклатуры = ЦеныНоменклатуры.АналитикаУчетаНоменклатуры
				|			И ПорчаТоваровСКлючамиАналитики.ВидЗапасов = ЦеныНоменклатуры.ВидЗапасов
				|			И (ЦеныНоменклатуры.Организация = &Организация)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПорчаТоваровСКлючамиАналитики.Ссылка,
				|	ПорчаТоваровСКлючамиАналитики.НомерСтроки";

			Иначе
				// Фактический расчет
				ЗапросПоТоварам.Текст =
				"ВЫБРАТЬ
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
				|	ПорчаТоваровОбщая.ВидЗапасов КАК ВидЗапасов,
				|	ПорчаТоваровОбщая.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
				|	ПорчаТоваровОбщая.Количество КАК Количество,
				|	ПорчаТоваровОбщая.НомерСтроки КАК НомерСтроки,
				|	ПорчаТоваровОбщая.НоменклатураОприходование КАК НоменклатураОприходование,
				|	ПорчаТоваровОбщая.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
				|	ПорчаТоваровОбщая.Цена КАК Цена,
				|	ПорчаТоваровОбщая.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ПорчаТоваровСКлючамиАналитики
				|ИЗ
				|	(ВЫБРАТЬ
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
				|		ПорчаТоваровВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
				|		ПорчаТоваровВидыЗапасов.Количество КАК Количество,
				|		ПорчаТоваровВидыЗапасов.НомерСтроки КАК НомерСтроки,
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Номенклатура КАК НоменклатураОприходование,
				|		ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Характеристика КАК ХарактеристикаОприходование,
				|		ВЫРАЗИТЬ(ПорчаТоваровТовары.Цена * &КоэффициентПересчетаВалютыДокументаВВалютуРегл КАК ЧИСЛО(31, 2)) КАК Цена,
				|		ПорчаТоваровВидыЗапасов.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.ПорчаТоваров.ВидыЗапасов КАК ПорчаТоваровВидыЗапасов
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
				|			ПО ПорчаТоваровВидыЗапасов.АналитикаУчетаНоменклатуры = ПорчаТоваровТовары.АналитикаУчетаНоменклатуры
				|			И ПорчаТоваровВидыЗапасов.Ссылка = ПорчаТоваровТовары.Ссылка) КАК ПорчаТоваровОбщая
				|ГДЕ
				|	ПорчаТоваровОбщая.Ссылка = &ТекущийДокумент
				|	И ПорчаТоваровОбщая.Ссылка.Организация = &Организация
				|	И ПорчаТоваровОбщая.Ссылка.Проведен
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
				|	СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
				|	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
				|	СУММА(СебестоимостьТоваров.СтоимостьРегл) КАК СтоимостьРегл,
				|	СУММА(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл +
				|		СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл +
				|		СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл) КАК Стоимость
				|ПОМЕСТИТЬ СебестоимостьТоваров
				|ИЗ
				|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
				|ГДЕ
				|	СебестоимостьТоваров.Регистратор = &ТекущийДокумент
				|СГРУППИРОВАТЬ ПО
				|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
				|	СебестоимостьТоваров.ВидЗапасов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.НаименованиеПолное КАК УтильНоменклатура,
				|	ПорчаТоваровСКлючамиАналитики.ХарактеристикаОприходование.НаименованиеПолное КАК УтильХарактеристика,
				|	&ТекстЗапросаКолонкаКодов КАК УтильКод,
				|	СУММА(ПорчаТоваровСКлючамиАналитики.Количество) КАК Количество,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество КАК ГрадацияКачества,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения) КАК
				|		ЕдиницаИзмеренияНаименование,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ВЫБОР
				|				КОГДА ЕСТЬNULL(СебестоимостьТоваров.Количество, 0) = 0
				|					ТОГДА 0
				|				ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваров.Стоимость, 0) / СебестоимостьТоваров.Количество
				|			КОНЕЦ
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК Цена
				|ИЗ
				|	ПорчаТоваровСКлючамиАналитики КАК ПорчаТоваровСКлючамиАналитики
				|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьТоваров КАК СебестоимостьТоваров
				|		ПО ПорчаТоваровСКлючамиАналитики.АналитикаУчетаНоменклатуры = СебестоимостьТоваров.АналитикаУчетаНоменклатуры
				|		И ПорчаТоваровСКлючамиАналитики.ВидЗапасов = СебестоимостьТоваров.ВидЗапасов
				|ГДЕ
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|СГРУППИРОВАТЬ ПО
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.НаименованиеПолное,
				|	ПорчаТоваровСКлючамиАналитики.ХарактеристикаОприходование.НаименованиеПолное,
				|	&ТекстЗапросаКолонкаКодов,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения.Код,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.ЕдиницаИзмерения),
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ВЫБОР
				|				КОГДА ЕСТЬNULL(СебестоимостьТоваров.Количество, 0) = 0
				|					ТОГДА 0
				|				ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваров.Стоимость, 0) / СебестоимостьТоваров.Количество
				|			КОНЕЦ
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПорчаТоваровСКлючамиАналитики.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
				|	ПРЕДСТАВЛЕНИЕ(ПорчаТоваровСКлючамиАналитики.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
				|	ПорчаТоваровСКлючамиАналитики.НомерСтроки КАК НомерСтроки,
				|	ПорчаТоваровСКлючамиАналитики.Количество КАК Количество,
				|	ВЫБОР
				|		КОГДА
				|			ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Количество
				|	КОНЕЦ КАК УценкаКоличество,
				|	ВЫБОР
				|		КОГДА
				|			ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ВЫБОР
				|				КОГДА ЕСТЬNULL(СебестоимостьТоваров.Количество, 0) = 0
				|					ТОГДА 0
				|				ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваров.СтоимостьРегл, 0) / СебестоимостьТоваров.Количество
				|			КОНЕЦ
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК УценкаЦена,
				|	ВЫБОР
				|		КОГДА
				|			ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.НеГоден)
				|			ТОГДА 0
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ВЫБОР
				|				КОГДА ЕСТЬNULL(СебестоимостьТоваров.Количество, 0) = 0
				|					ТОГДА 0
				|				ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваров.СтоимостьРегл, 0) / СебестоимостьТоваров.Количество *
				|					ПорчаТоваровСКлючамиАналитики.Количество
				|			КОНЕЦ
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Количество * ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК УценкаСтоимость,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.Код КАК ТоварКод,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.Артикул КАК ТоварАртикул,
				|	ВЫБОР
				|		КОГДА ПорчаТоваровСКлючамиАналитики.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
				|			ТОГДА ВЫБОР
				|					КОГДА ЕСТЬNULL(СебестоимостьТоваров.Количество, 0) = 0
				|						ТОГДА 0
				|					ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваров.Стоимость, 0) / СебестоимостьТоваров.Количество
				|				КОНЕЦ
				|		ИНАЧЕ ПорчаТоваровСКлючамиАналитики.Цена
				|	КОНЕЦ КАК Цена,
				|	ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование.Качество КАК ГрадацияКачества,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
				|	ПорчаТоваровСКлючамиАналитики.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ
				|ИЗ
				|	ПорчаТоваровСКлючамиАналитики КАК ПорчаТоваровСКлючамиАналитики
				|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьТоваров КАК СебестоимостьТоваров
				|		ПО ПорчаТоваровСКлючамиАналитики.АналитикаУчетаНоменклатуры = СебестоимостьТоваров.АналитикаУчетаНоменклатуры
				|		И ПорчаТоваровСКлючамиАналитики.ВидЗапасов = СебестоимостьТоваров.ВидЗапасов";

				ИтераторНомераЗапроса = 1;

			КонецЕсли;

			ЗапросПоТоварам.УстановитьПараметр("ТекущийДокумент", ВыборкаПоДокументам.Ссылка);
			ЗапросПоТоварам.УстановитьПараметр("ДатаЦен", ВыборкаПоДокументам.Дата);
			ЗапросПоТоварам.УстановитьПараметр("Организация", ВыборкаПоДокументам.Организация);
			ЗапросПоТоварам.УстановитьПараметр("Склад", ВыборкаПоДокументам.Склад);

			КоэффицентыВалютыДокумента = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
			ВыборкаПоДокументам.ВалютаДокумента, Неопределено, ВыборкаПоДокументам.Дата, ВыборкаПоДокументам.Организация);

			ЗапросПоТоварам.УстановитьПараметр("КоэффициентПересчетаВалютыДокументаВВалютуРегл",
			КоэффицентыВалютыДокумента.КоэффициентПересчетаВВалютуРегл);

			ЗапросПоТоварам.Текст = СтрЗаменить(ЗапросПоТоварам.Текст,
			"&ТекстЗапросаКолонкаКодов",
			"ПорчаТоваровСКлючамиАналитики.НоменклатураОприходование." + КолонкаКодов);

			РезультатыПоТоварам = ЗапросПоТоварам.ВыполнитьПакет(); 
			ВыборкаСтрокТовары	= РезультатыПоТоварам[2 + ИтераторНомераЗапроса].Выбрать();
			ВыборкаСтрокУтиль	= РезультатыПоТоварам[1 + ИтераторНомераЗапроса].Выбрать();

		КонецЕсли;

		НомерСтраницы			= 1;
		ОбластьШапки.Параметры.Заполнить(ВыборкаПоДокументам);
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаПоДокументам.Организация, ВыборкаПоДокументам.ДатаДокумента);
		ОбластьШапки.Параметры.ОрганизацияПредставление 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес");
		ОбластьШапки.Параметры.НомерДокумента 				= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.Номер);
		ОбластьШапки.Параметры.ФИОРуководителя 				= ВыборкаПоДокументам.Руководитель;
		ОбластьШапки.Параметры.ПодразделениеПредставление 	= СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоДокументам.СкладПредставление);

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьШапки, ВыборкаПоДокументам.Ссылка);
		ТабДокумент.Вывести(ОбластьШапки);

		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 

		ИтогоСтоимость 		  = 0;
		ИтогоКоличество 	  = 0;
		ИтогоУценкаКоличество = 0;
		ИтогоУценкаСтоимость  = 0;
		ИтогоУценкаСумма      = 0;
		// Выводим многострочную часть документа

		КоличествоСтрок 	= ВыборкаСтрокТовары.Количество();
		ПерваяСтрока		= Истина;

		ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
		ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

		Пока ВыборкаСтрокТовары.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);

			ОбластьСтрока.Параметры.ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаСтрокТовары.НоменклатураПредставление,
			ВыборкаСтрокТовары.ХарактеристикаПредставление,
			,
			,
			ДопПараметрыПредставлениеНоменклатуры);

			ЦенаНеЗадана = НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Цена);
			ОбластьСтрока.Параметры.Цена	= ?(ЦенаНеЗадана, 0, ВыборкаСтрокТовары.Цена);
			ОбластьСтрока.Параметры.Сумма	= ?(ЦенаНеЗадана, 0, ВыборкаСтрокТовары.Цена * ВыборкаСтрокТовары.Количество);

			ЦенаУценкиНеЗадана = Не ЗначениеЗаполнено(ВыборкаСтрокТовары.УценкаЦена);

			ОбластьСтрока.Параметры.УценкаЦена		= ?(ЦенаУценкиНеЗадана, 0, ВыборкаСтрокТовары.УценкаЦена);
			ОбластьСтрока.Параметры.УценкаСтоимость	= ?(ЦенаУценкиНеЗадана, 0, ВыборкаСтрокТовары.УценкаЦена * ВыборкаСтрокТовары.Количество);

			Если Не (ЦенаНеЗадана)
				И ВыборкаСтрокТовары.ГрадацияКачества <> Перечисления.ГрадацииКачества.НеГоден
				И Не ВыборкаПоДокументам.ПриходоватьТоварыПоСебестоимостиСписания Тогда
				ОбластьСтрока.Параметры.УценкаСумма = ОбластьСтрока.Параметры.Сумма - ОбластьСтрока.Параметры.УценкаСтоимость;
				ОбластьСтрока.Параметры.ПроцентСкидки = ОбластьСтрока.Параметры.УценкаСумма/ОбластьСтрока.Параметры.Сумма*100;
			Иначе
				ОбластьСтрока.Параметры.УценкаСумма = 0;
				ОбластьСтрока.Параметры.ПроцентСкидки = 0;
			КонецЕсли;

			Если ПерваяСтрока Тогда
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
				ПерваяСтрока = Ложь;
			Иначе
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
				МассивВыводимыхОбластей.Добавить(ОбластьИтого);
				Если ВыборкаСтрокТовары.НомерСтроки = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
				КонецЕсли;

				Если Не ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда

					НомерСтраницы = НомерСтраницы + 1;
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);

				КонецЕсли;

			КонецЕсли;

			ТабДокумент.Вывести(ОбластьСтрока);

			// Обновим итоги по документу
			ИтогоСтоимость = ИтогоСтоимость + ОбластьСтрока.Параметры.Сумма;
			ИтогоКоличество = ИтогоКоличество + ВыборкаСтрокТовары.Количество;
			ИтогоУценкаКоличество = ИтогоУценкаКоличество + ВыборкаСтрокТовары.УценкаКоличество;
			Если Не ВыборкаПоДокументам.ПриходоватьТоварыПоСебестоимостиСписания Тогда
				ИтогоУценкаСтоимость = ИтогоУценкаСтоимость + ОбластьСтрока.Параметры.УценкаСтоимость;
				ИтогоУценкаСумма = ИтогоУценкаСумма + ОбластьСтрока.Параметры.УценкаСумма;
			КонецЕсли;
		КонецЦикла;

		// Выводим итоги по документу в общем
		ОбластьИтого.Параметры.ИтогоСумма = ИтогоСтоимость;
		ОбластьИтого.Параметры.ИтогоКоличество = ИтогоКоличество;
		ОбластьИтого.Параметры.ИтогоУценкаКоличество = ИтогоУценкаКоличество;
		ОбластьИтого.Параметры.ИтогоУценкаСумма = ИтогоУценкаСумма;
		ОбластьИтого.Параметры.ИтогоУценкаСтоимость = ИтогоУценкаСтоимость;
		СуммаРасходовПорчи = ?(ИтогоУценкаСумма = 0, ИтогоСтоимость, ИтогоУценкаСтоимость);
		ТабДокумент.Вывести(ОбластьИтого);

		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаПоДокументам);
		ТабДокумент.Вывести(ОбластьПодвал);

		#Удаление
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		#КонецУдаления
		#Вставка
		Если НЕ ПараметрыПечати.Свойство("ПечатьКомплектаДокументовПересчет") Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			НомерСтраницы = НомерСтраницы + 1;
		КонецЕсли;
		#КонецВставки

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ПерваяСтрока = Истина;
		#Удаление
		НомерСтраницы    = НомерСтраницы + 1;
		#КонецУдаления
		ОбластьЗаголовокТаблицыУтиль.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 

		ИтогоУтильКоличество 	= 0;
		ИтогоУтильСумма 		= 0;

		ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
		ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

		Пока ВыборкаСтрокУтиль.Следующий() Цикл

			ОбластьСтрокаУтиль.Параметры.Заполнить(ВыборкаСтрокУтиль);
			ОбластьСтрокаУтиль.Параметры.УтильНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаСтрокУтиль.УтильНоменклатура,
			ВыборкаСтрокУтиль.УтильХарактеристика,
			,
			,
			ДопПараметрыПредставлениеНоменклатуры);

			ЦенаНеЗадана = НЕ ЗначениеЗаполнено(ВыборкаСтрокУтиль.Цена);
			ОбластьСтрокаУтиль.Параметры.Цена	= ?(ЦенаНеЗадана, 0, ВыборкаСтрокУтиль.Цена);
			ОбластьСтрокаУтиль.Параметры.Сумма	= ?(ЦенаНеЗадана, 0, ОбластьСтрокаУтиль.Параметры.Цена * ОбластьСтрокаУтиль.Параметры.Количество);

			Если ПерваяСтрока Тогда
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицыУтиль);
				ПерваяСтрока = Ложь;
			Иначе
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьСтрокаУтиль);
				МассивВыводимыхОбластей.Добавить(ОбластьИтогоУтиль);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
				Если Не ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда

					НомерСтраницы = НомерСтраницы + 1;
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ОбластьЗаголовокТаблицыУтиль.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабДокумент.Вывести(ОбластьЗаголовокТаблицыУтиль);

				КонецЕсли;

			КонецЕсли;

			ТабДокумент.Вывести(ОбластьСтрокаУтиль);
			// Обновим итоги по документу
			ИтогоУтильКоличество = ИтогоУтильКоличество + ОбластьСтрокаУтиль.Параметры.Количество;
			ИтогоУтильСумма = ИтогоУтильСумма + ОбластьСтрокаУтиль.Параметры.Сумма;

		КонецЦикла;

		Если ВыборкаСтрокУтиль.Количество() > 0 Тогда
			ОбластьИтогоУтиль.Параметры.ИтогоСумма = ИтогоУтильСумма;
			ОбластьИтогоУтиль.Параметры.ИтогоКоличество = ИтогоУтильКоличество;
			ТабДокумент.Вывести(ОбластьИтогоУтиль);
		КонецЕсли;

		// Выводим подписи документа
		ОбластьПодписи.Параметры.Заполнить(ВыборкаПоДокументам);
		ОбластьПодписи.Параметры.СуммаСписанияПрописью 	  = РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(Цел(ИтогоУценкаСумма), Справочники.Валюты.ПустаяСсылка(), Истина);
		СписанияКопеек = (ИтогоУценкаСумма - Цел(ИтогоУценкаСумма)) * 100;
		ОбластьПодписи.Параметры.СписанияКопеек = Формат(СписанияКопеек, "ЧЦ=2; ЧДЦ=0; ЧН='00'");

		ОбластьПодписи.Параметры.СуммаСписанияУтиляЛомаПрописью = РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(Цел(ИтогоУтильСумма), Справочники.Валюты.ПустаяСсылка(), Истина);
		УтильКопеек = (ИтогоУтильСумма - Цел(ИтогоУтильСумма)) * 100;
		ОбластьПодписи.Параметры.УтильКопеек = Формат(УтильКопеек, "ЧЦ=2; ЧДЦ=0; ЧН='00'");

		ОбластьПодписи.Параметры.ДолжностьПредседателя	  = ВыборкаПоДокументам.ДолжностьРуководителя;
		ОбластьПодписи.Параметры.ФИОпредседателя     	  = ВыборкаПоДокументам.Руководитель;
		ОбластьПодписи.Параметры.ДолжностьЧленаКомиссии2  = НСтр("ru='Главный бухгалтер'", Метаданные.Языки.Русский.КодЯзыка);
		ОбластьПодписи.Параметры.ФИОЧленаКомиссии2        = ВыборкаПоДокументам.ГлавныйБухгалтер;
		ОбластьПодписи.Параметры.ДолжностьЧленаКомиссии3  = ВыборкаПоДокументам.ДолжностьКладовщика;
		ОбластьПодписи.Параметры.ФИОЧленаКомиссии3        = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Кладовщик, ВыборкаПоДокументам.ДатаДокумента);
		ОбластьПодписи.Параметры.ФИОЧленаРасчетчика       = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Расчетчик, ВыборкаПоДокументам.ДатаДокумента);

		ТабДокумент.Вывести(ОбластьПодписи);

		НомерДокумента = НомерДокумента + 1;
		Если НомерДокумента < КоличествоДокументов Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);

	КонецЦикла;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат ТабДокумент;
КонецФункции
